In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
from pyxlsb import open_workbook as open_xlsb

# Read datasets

In [6]:
sheets = ['SALES DATA','PRODUCT','INVENTORY DATA','CUSTOMER DATA']
data = {}

for i in range(3,7):
    df = []

    with open_xlsb('data/POC-DATA-JUNE1.xlsb') as wb:
        with wb.get_sheet(i) as sheet:
            for row in sheet.rows():
                df.append([item.v for item in row])

    data[sheets[i-3]] = pd.DataFrame(df[1:], columns=df[0])

# Data clean

In [7]:
data['SALES DATA'].head()

,InvoiceNo,StockCode,Quantity Shipped,Year,Invoice Date,UnitPrice,Ext-Price,CustomerID,Country,GM%,Shipper,COST,EXT COST,REGION,SALES P,None
0,568200,PADS,5.00,2017.0,43003,0.999975,4.999876,16198.0,United Kingdom,0.000023,Delivery Truck,0.999953,4.999763,SOUTH,GRACE J,NaN
1,568375,BANK CHARGES,5.00,2017.0,43004,0.999977,4.999883,13405.0,United Kingdom,1.000000,UPS Next day Air,0.000000,0.000000,WEST,JEFF Y,NaN
2,561226,PADS,5.00,2017.0,42942,0.999886,4.999428,15618.0,United Kingdom,-0.000067,Delivery Truck,0.999953,4.999763,SOUTH,GRACE J,NaN
3,2550193,PADS,7.08,2018.0,43259,0.999962,7.079728,13952.0,United Kingdom,0.000009,UPS ground 2nd day,0.999953,7.079664,CENTRAL,PETER T,NaN
4,550193,PADS,5.00,2017.0,42840,0.999988,4.999940,13952.0,United Kingdom,0.000035,UPS ground 2nd day,0.999953,4.999763,CENTRAL,PETER T,NaN

In [12]:
data['SALES DATA'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 566309 entries, 0 to 566308
Data columns (total 16 columns):
InvoiceNo           566309 non-null object
StockCode           566309 non-null object
Quantity Shipped    566309 non-null float64
Year                566309 non-null float64
Invoice Date        566309 non-null object
UnitPrice           566309 non-null float64
Ext-Price           566309 non-null float64
CustomerID          566309 non-null float64
Country             566309 non-null object
GM%                 566309 non-null float64
Shipper             566309 non-null object
COST                566309 non-null float64
EXT COST            566309 non-null float64
REGION              566309 non-null object
SALES P             566309 non-null object
None                166199 non-null float64
dtypes: float64(9), object(7)
memory usage: 69.1+ MB

In [19]:
data['SALES DATA'].iloc[:,-1].value_counts(dropna = False).head()

NaN      400110
 1.00      4526
 8.95      2143
 9.10      1966
 2.95      1894
dtype: int64

Find a non-named column which most value is missing.

In [21]:
data['SALES DATA']['Quantity Shipped'].value_counts().tail()

277.34400     1
186.62400     1
46.57500      1
8.99775       1
1371.43125    1
Name: Quantity Shipped, dtype: int64

Lots of quantity shipped is a float value instead of integer.

In [8]:
data['PRODUCT'].head()

  StockCode Commodity
0     10002      Bolt
1     10080      Bolt
2     10120      Bolt
3     10125      Bolt
4     10133      Bolt

In [13]:
data['PRODUCT'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3958 entries, 0 to 3957
Data columns (total 2 columns):
StockCode    3958 non-null object
Commodity    3958 non-null object
dtypes: object(2)
memory usage: 61.9+ KB

In [9]:
data['INVENTORY DATA'].head()

,LOCATION,StockCode,DESCRIPTION,QUANTITY ON HAND,UNIT OF MEASURE,UNIT COST,EXTENDED COST,DATE,LAST RECEIPT DATE
0,WSE 1,40005B,None,0.0,EACH,1.049867,0.0,43252.0,43237.0
1,WSE 1,44242A,None,0.0,EACH,0.000000,0.0,43252.0,42057.0
2,WSE 1,37491B,None,0.0,EACH,1.069300,0.0,43252.0,41309.0
3,WSE 1,37491C,None,0.0,EACH,0.720838,0.0,43252.0,42594.0
4,WSE 1,37477B,None,0.0,EACH,0.000000,0.0,43252.0,41614.0

In [14]:
data['INVENTORY DATA'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7476 entries, 0 to 7475
Data columns (total 9 columns):
LOCATION              7476 non-null object
StockCode             7476 non-null object
DESCRIPTION           0 non-null object
QUANTITY ON HAND      7476 non-null float64
UNIT OF MEASURE       7476 non-null object
UNIT COST             7476 non-null float64
EXTENDED COST         7476 non-null float64
DATE                  7476 non-null float64
LAST RECEIPT DATE     7476 non-null float64
dtypes: float64(5), object(4)
memory usage: 525.7+ KB

In [22]:
data['INVENTORY DATA']['DESCRIPTION'].unique()

array([None], dtype=object)

In [23]:
data['INVENTORY DATA'].drop('DESCRIPTION',axis = 1,inplace = True)

In [24]:
data['INVENTORY DATA'].shape

(7476, 8)

Drop Description column because it doesn't contain any value.

In [40]:
data['INVENTORY DATA']['UNIT OF MEASURE'].value_counts()

EACH    7476
Name: UNIT OF MEASURE, dtype: int64

In [41]:
data['INVENTORY DATA'].drop('UNIT OF MEASURE',axis = 1, inplace = True)

In [42]:
data['INVENTORY DATA'].shape

(7476, 7)

Drop Unit of Measure column because it cantain all the same value.

In [11]:
data['CUSTOMER DATA'].head()

    NaN  CustomerID   REGION SALES PERSON
0  None     17314.0  CENTRAL       GAIL H
1  None     17373.0  CENTRAL       GAIL H
2  None     18145.0  CENTRAL       GAIL H
3  None     14467.0  CENTRAL       GAIL H
4  None     12908.0  CENTRAL       GAIL H

In [15]:
data['CUSTOMER DATA'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4372 entries, 0 to 4371
Data columns (total 4 columns):
None            0 non-null object
CustomerID      4372 non-null float64
REGION          4372 non-null object
SALES PERSON    4372 non-null object
dtypes: float64(1), object(3)
memory usage: 136.7+ KB

In [31]:
data['CUSTOMER DATA'].iloc[:,0].unique()

array([None], dtype=object)

In [32]:
data['CUSTOMER DATA'].dropna(axis = 1, how='all',inplace =True)

In [33]:
data['CUSTOMER DATA'].shape

(4372, 3)

# Merge datasets

In [177]:
df = pd.merge(data['SALES DATA'],data['PRODUCT'],how = 'left',on='StockCode')
df = pd.merge(df,data['CUSTOMER DATA'],how='left',on='CustomerID')

In [35]:
df.shape

(566309, 19)

In [36]:
df.head()

,InvoiceNo,StockCode,Quantity Shipped,Year,Invoice Date,UnitPrice,Ext-Price,CustomerID,Country,GM%,Shipper,COST,EXT COST,REGION_x,SALES P,None,Commodity,REGION_y,SALES PERSON
0,568200,PADS,5.00,2017.0,43003,0.999975,4.999876,16198.0,United Kingdom,0.000023,Delivery Truck,0.999953,4.999763,SOUTH,GRACE J,NaN,Studs,SOUTH,GRACE J
1,568375,BANK CHARGES,5.00,2017.0,43004,0.999977,4.999883,13405.0,United Kingdom,1.000000,UPS Next day Air,0.000000,0.000000,WEST,JEFF Y,NaN,Studs,WEST,JEFF Y
2,561226,PADS,5.00,2017.0,42942,0.999886,4.999428,15618.0,United Kingdom,-0.000067,Delivery Truck,0.999953,4.999763,SOUTH,GRACE J,NaN,Studs,SOUTH,GRACE J
3,2550193,PADS,7.08,2018.0,43259,0.999962,7.079728,13952.0,United Kingdom,0.000009,UPS ground 2nd day,0.999953,7.079664,CENTRAL,PETER T,NaN,Studs,CENTRAL,PETER T
4,550193,PADS,5.00,2017.0,42840,0.999988,4.999940,13952.0,United Kingdom,0.000035,UPS ground 2nd day,0.999953,4.999763,CENTRAL,PETER T,NaN,Studs,CENTRAL,PETER T

# Because stockcode isn't unique in Inventory data table, we only select date from 2018

In [147]:
data['INVENTORY DATA']['DATE'].value_counts()

42887.0    3738
43252.0    3738
Name: DATE, dtype: int64

In [174]:
inventory_2018 = data['INVENTORY DATA'][data['INVENTORY DATA']['DATE']==43252]

In [175]:
inventory_2018.shape

(3738, 7)

In [178]:
df = pd.merge(df,inventory_2018,how ='left',on='StockCode')

In [179]:
df.shape

(566309, 25)

# Clean the merged data

In [180]:
df.head()

,InvoiceNo,StockCode,Quantity Shipped,Year,Invoice Date,UnitPrice,Ext-Price,CustomerID,Country,GM%,...,None,Commodity,REGION_y,SALES PERSON,LOCATION,QUANTITY ON HAND,UNIT COST,EXTENDED COST,DATE,LAST RECEIPT DATE
0,568200,PADS,5.00,2017.0,43003,0.999975,4.999876,16198.0,United Kingdom,0.000023,...,NaN,Studs,SOUTH,GRACE J,WSE 1,0.833333,0.999953,0.833294,43252.0,43126.0
1,568375,BANK CHARGES,5.00,2017.0,43004,0.999977,4.999883,13405.0,United Kingdom,1.000000,...,NaN,Studs,WEST,JEFF Y,NaN,NaN,NaN,NaN,NaN,NaN
2,561226,PADS,5.00,2017.0,42942,0.999886,4.999428,15618.0,United Kingdom,-0.000067,...,NaN,Studs,SOUTH,GRACE J,WSE 1,0.833333,0.999953,0.833294,43252.0,43126.0
3,2550193,PADS,7.08,2018.0,43259,0.999962,7.079728,13952.0,United Kingdom,0.000009,...,NaN,Studs,CENTRAL,PETER T,WSE 1,0.833333,0.999953,0.833294,43252.0,43126.0
4,550193,PADS,5.00,2017.0,42840,0.999988,4.999940,13952.0,United Kingdom,0.000035,...,NaN,Studs,CENTRAL,PETER T,WSE 1,0.833333,0.999953,0.833294,43252.0,43126.0

In [181]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 566309 entries, 0 to 566308
Data columns (total 25 columns):
InvoiceNo             566309 non-null object
StockCode             566309 non-null object
Quantity Shipped      566309 non-null float64
Year                  566309 non-null float64
Invoice Date          566309 non-null object
UnitPrice             566309 non-null float64
Ext-Price             566309 non-null float64
CustomerID            566309 non-null float64
Country               566309 non-null object
GM%                   566309 non-null float64
Shipper               566309 non-null object
COST                  566309 non-null float64
EXT COST              566309 non-null float64
REGION_x              566309 non-null object
SALES P               566309 non-null object
None                  166199 non-null float64
Commodity             563862 non-null object
REGION_y              566309 non-null object
SALES PERSON          566309 non-null object
LOCATION              560030 non-null object
QUANTITY ON HAND      560030 non-null float64
UNIT COST             560030 non-null float64
EXTENDED COST         560030 non-null float64
DATE                  560030 non-null float64
LAST RECEIPT DATE     560030 non-null float64
dtypes: float64(14), object(11)
memory usage: 112.3+ MB

In [182]:
df.columns

Index([         'InvoiceNo',          'StockCode',   'Quantity Shipped',
                     'Year',       'Invoice Date',          'UnitPrice',
                'Ext-Price',         'CustomerID',            'Country',
                      'GM%',            'Shipper',               'COST',
                 'EXT COST',           'REGION_x',            'SALES P',
                       None,          'Commodity',           'REGION_y',
             'SALES PERSON',           'LOCATION',   'QUANTITY ON HAND',
                'UNIT COST',      'EXTENDED COST',               'DATE',
       'LAST RECEIPT DATE '],
      dtype='object')

In [183]:
df.columns = ['invoice_no','stock_code','quantity_shipped','year','invoice_date'\
              ,'unit_price','ext_price','customer_id','country','gm','shipper'\
              ,'cost','ext_cost','customer_region','sales_rep','unnamed','product_group'\
              ,'customer_region_1','sales_rep_1','location','quantity_on_hand','unit_cost'\
              ,'ext_cost','date','last_receipt_date']

Rename columns for easy reference.

In [184]:
df.describe()

,quantity_shipped,year,unit_price,ext_price,customer_id,gm,cost,ext_cost,unnamed,quantity_on_hand,unit_cost,ext_cost,date,last_receipt_date
count,566309.000000,566309.000000,566309.000000,566309.000000,566309.000000,566309.000000,566309.000000,566309.000000,1.661990e+05,560030.000000,560030.000000,560030.000000,560030.0,560030.000000
mean,58.856724,2017.247344,1.269592,80.986009,15350.700681,0.076228,1.087992,67.899410,1.579200e+02,11118.897896,1.097111,10834.162047,43252.0,42262.928056
std,1264.412523,0.536288,1.010798,2012.332810,1731.767269,0.387442,0.585696,1517.514476,5.512103e+03,21413.950593,0.581101,19564.343362,0.0,564.429263
min,0.060000,2016.000000,0.084250,0.124477,12346.000000,-126.962574,0.000000,0.000000,-4.117000e+01,0.000000,0.078919,0.000000,43252.0,41275.000000
25%,3.823200,2017.000000,0.951196,3.815059,13963.000000,-0.051465,0.854221,3.185624,3.186000e+00,1029.375000,0.860295,1014.073998,43252.0,41765.000000
50%,10.000000,2017.000000,1.097356,10.832956,15288.000000,0.046404,1.101769,9.340634,1.368000e+01,3543.545455,1.104343,3753.661509,43252.0,42277.000000
75%,24.000000,2018.000000,1.355904,27.259008,16921.000000,0.255980,1.260469,24.410862,4.773000e+01,10944.166667,1.265892,10737.011969,43252.0,42745.000000
max,664224.250000,2018.000000,188.185900,750849.719788,18287.000000,1.000000,33.942550,855425.223509,1.873030e+06,206633.000000,33.942550,263701.569347,43252.0,43252.000000

# convert invoice_date, date, last_receipe_date to datetime format

In [185]:
df.date.head(10)

0    43252.0
1        NaN
2    43252.0
3    43252.0
4    43252.0
5    43252.0
6    43252.0
7    43252.0
8    43252.0
9    43252.0
Name: date, dtype: float64

In [186]:
invoice_date = pd.to_numeric(df['invoice_date'],errors='coerce')
df['invoice_date'] = pd.to_datetime(invoice_date-25569,unit='D')

In [187]:
df['invoice_date'].isnull().sum()

233

In [189]:
df['date']=pd.to_datetime(df.date-25569,unit='D')
df['last_receipt_date']=pd.to_datetime(df.last_receipt_date-25569,unit='D')

In [192]:
df.to_csv('cleaned_data.csv',index = False)